roles/emacs/files/README.org
# -*- evil-shift-width: 2; fill-column: 80; comment-column: 75; -*-
#+auto_tangle: t
#+startup: show2levels

* early-init.el
:PROPERTIES:
:header-args: :tangle "./early-init.el"
:END:
These settings are going into different init file: =early-init.el=, which will be
invoked before GUI invocation and general =init.el= file.
** Preamble

#+begin_src emacs-lisp
;;; early-init.el -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in ~/.config/emacs/README.org
;;;
;;; Code:
#+end_src

** Variables

#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum
      read-process-output-max (* 1024 1024 4) ; 4mb
      inhibit-compacting-font-caches t
      message-log-max 16384
      load-prefer-newer noninteractive)
#+end_src

=package.el= initialization is expensive, so we disable it here since we use
=elpaca= instead.

#+begin_src emacs-lisp
(setq package-enable-at-startup nil)
#+end_src

#+begin_src emacs-lisp
(when (featurep 'native-compile)
  (defvar inhibit-automatic-native-compilation)
  (setq inhibit-automatic-native-compilation nil)
  (defvar native-comp-async-report-warnings-errors)
  (setq native-comp-async-report-warnings-errors 'silent))
#+end_src

Prevent the glimpse of un-styled Emacs by disabling these UI elements early.

#+begin_src emacs-lisp
(setq tool-bar-mode nil
      menu-bar-mode nil)
(when (fboundp 'set-scroll-bar-mode)
  (set-scroll-bar-mode nil))
#+end_src

Resizing the Emacs frame can be a terribly expensive part of changing the font.
By inhibiting this, we easily halve startup times with fonts that are larger
than the system default.

#+begin_src emacs-lisp
(setq frame-inhibit-implied-resize t)
#+end_src

** (provide 'early-init)
This concludes the =early-init.el= file.

#+begin_src emacs-lisp
(provide 'early-init)
;;; early-init.el ends here
#+end_src


* init.el
:PROPERTIES:
:header-args: :tangle "./init.el"
:END:
** Preamble

#+begin_src emacs-lisp
;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in ~/.config/emacs/README.org
;;;
;;; Code:
#+end_src

** Setup =elpaca= package manager

#+begin_src emacs-lisp
(defvar elpaca-installer-version 0.3)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil
                              :files (:defaults (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (call-process "git" nil buffer t "clone"
                                       (plist-get order :repo) repo)))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (kill-buffer buffer)
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+end_src

Install use-package support and enable ~:elpaca~ use-package keyword.

#+begin_src emacs-lisp
(elpaca elpaca-use-package
        (elpaca-use-package-mode))
#+end_src

Block until current queue processed.

#+begin_src emacs-lisp
(elpaca-wait)
#+end_src

Make elpaca native keybindings have precedence over evil keymaps in elpaca buffer.
#+begin_src emacs-lisp
(with-eval-after-load 'evil
  (with-eval-after-load 'elpaca-ui   (evil-make-intercept-map elpaca-ui-mode-map))
  (with-eval-after-load 'elpaca-info (evil-make-intercept-map elpaca-info-mode-map)))
#+end_src

** Libraries

#+begin_src emacs-lisp
(use-package s    :elpaca t) ;; string manipulation library
(use-package dash :elpaca t) ;; list manipulation library
(use-package diminish :elpaca t)
(use-package hydra :elpaca t)
#+end_src

#+begin_src emacs-lisp
(use-package use-package
  :no-require
  :custom (use-package-enable-imenu-support t))
#+end_src

#+begin_src emacs-lisp
(use-package general
  :elpaca t
  :config (general-auto-unbind-keys))
#+end_src

#+begin_src emacs-lisp
(use-package all-the-icons
  :elpaca t
  :config
  (let ((cache (expand-file-name
                ".all-the-icons-font-installed" user-emacs-directory)))
    (unless (file-exists-p cache)
      (all-the-icons-install-fonts t)
      (with-temp-buffer (write-file cache)))))
#+end_src

** My keymaps
Define custom keymaps, which I will use later, here in one place.

#+begin_src emacs-lisp
(define-prefix-command 'leader-map)
(define-prefix-command 'semicolon-leader-map)
(define-prefix-command 'my/orgmode-leader-map)
(define-prefix-command 'my/notes-map)
#+end_src

** My functions
*** append-to-list
[[https://stackoverflow.com/questions/24356401/how-to-append-multiple-elements-to-a-list-in-emacs-lisp][Source]]
#+begin_src emacs-lisp
(defun my/append-to-list (list-var elements)
  "Append ELEMENTS to the end of LIST-VAR.

The return value is the new value of LIST-VAR."
  (unless (consp elements)
    (error "ELEMENTS must be a list"))
  (let ((list (symbol-value list-var)))
    (if list
        (setcdr (last list) elements)
      (set list-var elements)))
  (symbol-value list-var))
#+end_src

** Core settings
*** Emacs
#+begin_src emacs-lisp
(use-package better-defaults :elpaca t)
#+end_src

#+begin_src emacs-lisp :noweb yes
(use-package emacs
  :after better-defaults
  :custom
  <<customize-emacs-variables>>
  :config
  <<config-emacs-settings>>)
#+end_src

**** custom
:PROPERTIES:
:header-args: :noweb-ref customize-emacs-variables
:END:

User credentials. Some modes can use full name and e-mail address automatically.
#+begin_src emacs-lisp
(user-full-name "Yuriy Artemyev")
(user-mail-address "anuvyklack@gmail.com")
#+end_src

#+begin_src emacs-lisp
(ring-bell-function #'ignore)
(inhibit-startup-message t)
(cursor-type 'box)
(cursor-in-non-selected-windows nil)
(require-final-newline t)
#+end_src

Do not wrap long lines.

#+begin_src emacs-lisp
(truncate-lines t)
#+end_src

#+begin_src emacs-lisp
(fill-column 80)
#+end_src

#+begin_src emacs-lisp
(comment-empty-lines t)
#+end_src

Always move point into help buffer, when its appeares.

#+begin_src emacs-lisp
(help-window-select t)
(help-at-pt-display-when-idle t)
#+end_src

=M-=== key-chord (evil: =ga=) will show human readable output.

#+begin_src emacs-lisp
(what-cursor-show-names t)
#+end_src

По умолчанию Emacs считает, что предложение дожно заканчиваться 2 пробелами.

#+begin_src emacs-lisp
(sentence-end-double-space nil)
#+end_src

Do not jump half the page when point goes out of the screen.
#+begin_src emacs-lisp
(scroll-conservatively 101)
(scroll-margin 0)
(scroll-preserve-screen-position 'always)
;; (auto-window-vscroll nil)
(scroll-error-top-bottom nil)
(use-short-answers t)
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref config-emacs-settings
:END:

#+begin_src emacs-lisp
;; (menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(horizontal-scroll-bar-mode -1)
(blink-cursor-mode 0)
#+end_src

Give some breathing room.
#+begin_src emacs-lisp
(set-fringe-mode 3)
#+end_src

Show column number in modeline.
#+begin_src emacs-lisp
(column-number-mode 1)
#+end_src

***** COMMENT Yes or No
Prompt for =y= or =n= instead of =yes= or =no=.

#+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

***** Setup fonts and initial frame size and position

#+begin_src emacs-lisp :tangle no
(when window-system
  (set-face-attribute 'default nil :font "Inconsolata LGC" :height 125)
  ;; (set-face-attribute 'default nil :font "Monego" :height 125)
  (set-frame-size (selected-frame) 134 63)
  (set-frame-position (selected-frame) 1190 35))
#+end_src

*** Custom file
Emacs customization system writes to =init.el= by default, which is not great
when using tangle approach. So move custom modifications to a separate file.

#+begin_src emacs-lisp
(setq-default custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src

*** Display line numbers
#+begin_src emacs-lisp
(use-package display-line-numbers
  :custom
  ;; (display-line-numbers-width 4)
  (display-line-numbers-grow-only t)
  (display-line-numbers-width-start t)
  :hook (prog-mode . display-line-numbers-mode))
#+end_src

*** Display fill-column indicator
#+begin_src emacs-lisp
(use-package display-fill-column-indicator
  :hook (prog-mode . display-fill-column-indicator-mode))
#+end_src

*** electric-pair
Automatic parens pairing.

#+begin_src emacs-lisp :noweb yes
(use-package elec-pair
  :config
  (electric-pair-mode)
  :hook
  <<electric-pair-hook>>)
#+end_src

**** hook
:PROPERTIES:
:header-args: :noweb-ref electric-pair-hook
:END:

Make =electric-pair= mode not to complete ~<>~ pair when ~<~ char entered in org mode.

#+begin_src emacs-lisp
(org-mode . (lambda ()
              (setq-local electric-pair-inhibit-predicate
                          (lambda (c)
                            (if (char-equal c ?<)
                                t
                              (electric-pair-default-inhibit c))))))
#+end_src

*** Delete selection by typing

#+begin_src emacs-lisp
(use-package delsel
  :config
  (delete-selection-mode))
#+end_src

*** Mouse wheel

#+begin_src emacs-lisp
(use-package mwheel
  :custom
  (mouse-wheel-tilt-scroll t)
  (mouse-wheel-progressive-speed nil))
#+end_src

*** isearch
#+begin_src emacs-lisp
(use-package isearch
  :custom
  (isearch-lazy-count t)
  (isearch-lazy-highlight t))
#+end_src

*** outline
#+begin_src emacs-lisp
(use-package outline
  :custom
  (outline-minor-mode-cycle t))
#+end_src

*** tab-bar-mode
#+begin_src emacs-lisp
(use-package tab-bar
  :config (tab-bar-mode 1))
#+end_src

** Completion framework
*** COMMENT fido-vertical-mode
#+begin_src emacs-lisp
(use-package icomplete
  :config
  (fido-vertical-mode 1))
#+end_src

*** vertico
#+begin_src emacs-lisp :noweb yes
(use-package vertico
  :elpaca t
  :custom
  <<vertico-custom>>
  :bind (:map minibuffer-local-map
         ("C-h" . backward-kill-word))
  :init
  <<vertico-init>>
  :config
  <<vertico-config>>)
#+end_src

**** custom
:PROPERTIES:
:header-args: :noweb-ref vertico-custom
:END:

#+begin_src emacs-lisp
(vertico-count 14) ;; How many candidates to show.
(vertico-scroll-margin 2)
(vertico-cycle nil)
#+end_src

Emacs 28: Hide commands in =M-x= which do not work in the current mode.
Vertico commands are hidden in normal buffers.
#+begin_src emacs-lisp
;; (read-extended-command-predicate #'command-completion-default-include-p)
#+end_src

#+begin_src emacs-lisp
(enable-recursive-minibuffers t)
(minibuffer-depth-indicate-mode t)
#+end_src

#+begin_src emacs-lisp
(read-file-name-completion-ignore-case t)
(read-buffer-completion-ignore-case t)
(completion-ignore-case t)
#+end_src

**** init
:PROPERTIES:
:header-args: :noweb-ref vertico-init
:END:

Turn off ~ido-mode~ because =better-defaults= package turns it on.
#+begin_src emacs-lisp
(ido-mode -1)
#+end_src

#+begin_src emacs-lisp
(vertico-mode)
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref vertico-config
:END:

#+begin_src emacs-lisp
(defun my/crm-indicator (args)
  "Add prompt indicator to `completing-read-multiple'.
We display [CRM<separator>], e.g., [CRM,] if the separator is a comma."
  (cons (format "[CRM%s] %s"
                (replace-regexp-in-string
                 "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                 crm-separator)
                (car args))
        (cdr args)))

(advice-add #'completing-read-multiple :filter-args #'my/crm-indicator)
#+end_src

Do not allow the cursor in the minibuffer prompt.
#+begin_src emacs-lisp
(setq minibuffer-prompt-properties '(read-only t
                                     cursor-intangible t
                                     face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src

*** orderless
#+begin_src emacs-lisp
(use-package orderless
  :elpaca t
  :after vertico
  :init
  (setq completion-styles '(orderless))
  (setq orderless-component-separator #'orderless-escapable-split-on-space)
  (setq orderless-matching-styles
        '(orderless-initialism orderless-prefixes orderless-regexp)))
#+end_src

*** marginalia
#+begin_src emacs-lisp
(use-package marginalia
  :elpaca t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))
#+end_src

*** consult
#+begin_src emacs-lisp
(use-package consult
  :elpaca t
  :init
  (setq completion-in-region-function #'consult-completion-in-region))
#+end_src

** COMMENT Smooth scrolling
*** pixel-scroll
#+begin_src emacs-lisp
(use-package pixel-scroll
  :when (fboundp #'pixel-scroll-precision-mode)
  :hook (after-init . pixel-scroll-precision-mode)
  :custom
  (scroll-margin 0)
  ;; pixel-scroll-precision-interpolate-page
  )
#+end_src

*** COMMENT good-scroll
#+begin_src emacs-lisp :noweb yes
(use-package good-scroll
  :elpaca t
  :after evil
  :custom (good-scroll-duration 0.3)
  :config
  (good-scroll-mode)
  <<good-scroll-config>>)
#+end_src

**** config
:PROPERTIES:
:header-args: :noweb-ref good-scroll-config
:END:
***** Replaca evil =C-y= / =C-e= keybindings

#+begin_src emacs-lisp
(let ((n 6))
  (define-advice evil-scroll-line-down
      (:around (orig-fun count) triple)
    (funcall orig-fun (* count n)))

  (define-advice evil-scroll-line-up
      (:around (orig-fun count) triple)
    (funcall orig-fun (* count n))))
#+end_src

